# Brewfile - Declarative package management for macOS
# Install with: brew bundle

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Core CLI Tools
brew "git"
brew "stow"                # Symlink farm manager
brew "neovim"
brew "tmux"

# Shell
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# Search & Navigation
brew "fzf"                 # Fuzzy finder
brew "ripgrep"             # Fast grep (rg)
brew "fd"                  # Fast find
brew "bat"                 # Better cat
brew "eza"                 # Better ls
brew "zoxide"              # Smarter cd

# Development
brew "fnm"                 # Fast Node Manager
brew "stylua"              # Lua formatter
brew "shellcheck"          # Shell script linter
brew "jq"                  # JSON processor
brew "direnv"              # Per-directory environment variables

# Modern CLI Enhancements
brew "starship"            # Cross-shell prompt
brew "atuin"               # Better shell history with sync
brew "tldr"                # Simplified man pages
brew "btop"                # Beautiful system monitor

# Git Enhancements
brew "gh"                  # GitHub CLI
brew "delta"               # Better git diff
brew "lazygit"             # Git TUI

# Containers & Cloud
brew "kubectl"
brew "docker"
brew "docker-compose"

# Fonts (Nerd Fonts for terminal icons)
cask "font-hack-nerd-font"

# Terminal Emulators
cask "kitty"
# cask "alacritty"         # Alternative
